"""Тестовые данные для проверки валидации полей формы активации бонусной карты"""


class ValidationField:

    NAME_FIELD_VALID = [
        ("valid_russian", "Олег", "+79991234567", None),
        ("valid_hyphen", "Анна-Мария", "+79991234567", None),
        ("valid_latin", "Oleg", "+79991234567", None),
        ("valid_20_characters", "OlegOlegOlegOlegOleg", "+79991234567", None)
    ]

    NAME_FIELD_INVALID = [
        ("invalid_digits", "Олег123", "+79991234567", "Введен неверный формат имени"),
        ("invalid_spec_symbols", "Олег!", "+79991234567", "Введен неверный формат имени"),
        ("invalid_empty", "", "+79991234567", 'Поле "Имя" обязательно для заполнения'),
        ("invalid_one_char", "И", "+79991234567", "Введен неверный формат имени"),
        ("invalid_one_space", " ", "+79991234567", "Введен неверный формат имени"),
        ("invalid_21_symbols", "OlegOlegOlegOlegOlegO", "+79991234567", "Введен неверный формат имени")
    ]

    PHONE_FIELD_VALID = [
        ("valid_standard", "Олег", "+79991234567", None),
        ("valid_standard", "Олег", "79991234567", None),
        ("valid_standard", "Олег", "89991234567", None),
        ("valid_standard", "Олег", "+89991234567", None)
    ]

    PHONE_FIELD_INVALID = [
        ("invalid_formatted", "Олег", "8 (999) 123-45-67", "Введен неверный формат телефона"),
        ("invalid_short_10_digits", "Олег", "+7999123490", "Введен неверный формат телефона"),
        ("invalid_12_digits", "Олег", "+799912349012", "Введен неверный формат телефона"),
        ("invalid_letters", "Олег", "+7999123456a", "Введен неверный формат телефона"),
        ("invalid_standard", "Олег", "-79991234567", "Введен неверный формат телефона"),
        ("invalid_empty", "Олег", "", 'Поле "Телефон" обязательно для заполнения'),
        ("invalid_one_space", "Олег", " ", "Введен неверный формат телефона")
    ]

    NAME_AND_PHONE_FIELD_EMPTY = [
        ("invalid_both_empty", "", "", 'Поле "Имя" обязательно для заполнения\n'
                                       'Поле "Телефон" обязательно для заполнения')
    ]
